app/Models/Admin/Ssh/Model_hspk.php

SELECT DISTINCT `tb_hspk`.`opd_id`, `auth_groups`.`description`
FROM `tb_hspk`
LEFT JOIN `auth_groups` ON `tb_hspk`.`opd_id` = `auth_groups`.`id`
LEFT JOIN `tb_verifikasi` ON `tb_hspk`.`id_hspk` = `tb_verifikasi`.`hspk_id`
WHERE `tb_hspk`.`tahun` = '2023'
AND `tb_hspk`.`opd_id` = '0003'
AND `tb_verifikasi`.`verifikasi` = 'lolos'
---
	public function hspk_cetak_filter($id)
	{
		return $this
			->DISTINCT('auth_groups.description')
			->DISTINCT('tb_hspk.opd_id')
			->select('tb_hspk.opd_id')
			->select('auth_groups.description')
			->join('auth_groups', 'tb_hspk.opd_id = auth_groups.id', 'LEFT')
			->join('tb_verifikasi', 'tb_hspk.id_hspk = tb_verifikasi.hspk_id', 'LEFT')
			->getWhere(['tb_hspk.tahun' => $_SESSION['tahun'], 'tb_hspk.opd_id' => $id, 'tb_verifikasi.verifikasi' => 'lolos'])->getResultArray();