app/Views/admin/Ssh/excel.php

SELECT DISTINCT `tb_jenis_rincian_objek_sub`.`jenis_rincian_objek_sub`, `tb_jenis_rincian_objek_sub`.`id_jenis_rincian_objek_sub`
FROM `tb_hspk`
LEFT JOIN `tb_jenis_rincian_objek_sub` ON `tb_hspk`.`jenis_rincian_objek_sub_id` = `tb_jenis_rincian_objek_sub`.`id_jenis_rincian_objek_sub`
LEFT JOIN `tb_verifikasi` ON `tb_hspk`.`id_hspk` = `tb_verifikasi`.`hspk_id`
WHERE `tb_hspk`.`opd_id` = '0003'
AND `tb_hspk`.`tahun` = '2023'
AND `tb_verifikasi`.`verifikasi` = 'lolos'
---
				<td>OPD</td>
				<td></td>
			</tr>
			<?php $rincian_objek = $db->table('tb_hspk')->DISTINCT('tb_hspk.id_hspk')->select('tb_jenis_rincian_objek_sub.jenis_rincian_objek_sub')->select('tb_jenis_rincian_objek_sub.id_jenis_rincian_objek_sub')->join('tb_jenis_rincian_objek_sub', 'tb_hspk.jenis_rincian_objek_sub_id = tb_jenis_rincian_objek_sub.id_jenis_rincian_objek_sub', 'LEFT')->join('tb_verifikasi', 'tb_hspk.id_hspk = tb_verifikasi.hspk_id', 'LEFT')->getWhere(['tb_hspk.opd_id' => $row['opd_id'], 'tb_hspk.tahun' => $_SESSION['tahun'], 'tb_verifikasi.verifikasi' => 'lolos'])->getResultArray(); ?>

SELECT `tb_hspk`.`hspk_paket`, `tb_hspk`.`id_hspk`
FROM `tb_hspk`
LEFT JOIN `tb_verifikasi` ON `tb_hspk`.`id_hspk` = `tb_verifikasi`.`hspk_id`
WHERE `tb_hspk`.`jenis_rincian_objek_sub_id` = '1744'
AND `tb_hspk`.`tahun` = '2023'
AND `tb_verifikasi`.`verifikasi` = 'lolos'
---
					<td></td>
					<td>Rincian_sub_objek</td>
				</tr>
				<?php $hspk = $db->table('tb_hspk')->select('tb_hspk.hspk_paket')->select('tb_hspk.id_hspk')->join('tb_verifikasi', 'tb_hspk.id_hspk = tb_verifikasi.hspk_id', 'LEFT')->getWhere(['tb_hspk.jenis_rincian_objek_sub_id' => $ros['id_jenis_rincian_objek_sub'], 'tb_hspk.tahun' => $_SESSION['tahun'], 'tb_verifikasi.verifikasi' => 'lolos'])->getResultArray(); ?>

SELECT `tb_hspk_komponen`.`index`, `tb_ssh`.*
FROM `tb_hspk_komponen`
LEFT JOIN `tb_ssh` ON `tb_hspk_komponen`.`ssh_id` = `tb_ssh`.`id_ssh`
WHERE `tb_hspk_komponen`.`hspk_id` = '15'
AND `tb_hspk_komponen`.`group` = 'A'
---
						<td>Tenaga_kerja</td>
					</tr>
					<?php $no = 1;
					$hspk_komponen = $db->table('tb_hspk_komponen')->select('tb_hspk_komponen.index')->select('tb_ssh.*')->join('tb_ssh', 'tb_hspk_komponen.ssh_id = tb_ssh.id_ssh', 'LEFT')->getWhere(['tb_hspk_komponen.hspk_id' => $rol['id_hspk'], 'tb_hspk_komponen.group' => 'A'])->getResultArray(); ?>

SELECT `tb_hspk_komponen`.`index`, `tb_ssh`.*
FROM `tb_hspk_komponen`
LEFT JOIN `tb_ssh` ON `tb_hspk_komponen`.`ssh_id` = `tb_ssh`.`id_ssh`
WHERE `tb_hspk_komponen`.`hspk_id` = '15'
AND `tb_hspk_komponen`.`group` = 'B'
---
						<td>Bahan</td>
					</tr>
					<?php $no = 1;
					$hspk_komponen = $db->table('tb_hspk_komponen')->select('tb_hspk_komponen.index')->select('tb_ssh.*')->join('tb_ssh', 'tb_hspk_komponen.ssh_id = tb_ssh.id_ssh', 'LEFT')->getWhere(['tb_hspk_komponen.hspk_id' => $rol['id_hspk'], 'tb_hspk_komponen.group' => 'B'])->getResultArray(); ?>

SELECT `tb_hspk_komponen`.`index`, `tb_ssh`.*
FROM `tb_hspk_komponen`
LEFT JOIN `tb_ssh` ON `tb_hspk_komponen`.`ssh_id` = `tb_ssh`.`id_ssh`
WHERE `tb_hspk_komponen`.`hspk_id` = '15'
AND `tb_hspk_komponen`.`group` = 'C'
---
						<td>Peralatan</td>
					</tr>
					<?php $no = 1;
					$hspk_komponen = $db->table('tb_hspk_komponen')->select('tb_hspk_komponen.index')->select('tb_ssh.*')->join('tb_ssh', 'tb_hspk_komponen.ssh_id = tb_ssh.id_ssh', 'LEFT')->getWhere(['tb_hspk_komponen.hspk_id' => $rol['id_hspk'], 'tb_hspk_komponen.group' => 'C'])->getResultArray(); ?>